cask_args appdir: '/Applications'

brew 'postgresql@14'
brew 'wget'
brew 'neovim'
brew 'nvm'
brew 'pnpm'
brew 'node'

brew 'starship'
brew 'tmux'
brew 'tpm'
brew 'stow'

cask 'handbrake'
cask 'notion-calendar'
cask 'raycast'
cask 'zed'
cask 'google-chrome'
cask 'visual-studio-code'
cask 'slack'
cask 'ticktick'
cask 'postman'
cask 'ghostty'
cask 'arc'
cask 'gpg-suite'
cask 'logi-options+'
cask 'mongodb-compass'
cask 'ngrok'
cask 'react-native-debugger'
cask 'rectangle'
cask 'the-unarchiver'