# Taps
tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'awscli'
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'ffmpeg'
brew 'gh'
brew 'git'
brew 'grep'
brew 'httpie'
brew 'mackup'
brew 'mas' # Mac App Store manager
brew 'svn' # Needed to install fonts

# Development
brew 'mysql'
brew 'nginx'
brew 'node'
brew 'redis'
brew 'yarn'
brew 'nvm'
brew 'python'
brew 'tree'
brew 'neovim'

# Apps
cask 'docker'
cask 'google-chrome'
cask 'pastebot'
cask 'ticktick'
cask 'private-internet-access'
cask 'visual-studio-code'
cask 'cleanmymac'
# cask 'figma'
# cask 'discord'
# cask 'github'
# cask 'slack'
# cask 'whatsapp'
# cask 'spotify'

# Utilities
cask 'the-unarchiver'
cask 'duet'
cask 'helium'
cask 'iterm2'
cask 'alfred'
cask 'spectacle'
cask 'macs-fan-control'
cask 'vanilla'
cask 'react-native-debugger'
cask 'postman'
cask 'handbrake'

# Fonts
cask 'font-lato'
cask 'font-open-sans'
cask 'font-roboto'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
mas 'Byword', id: 420212497
mas 'Giphy Capture', id: 668208984
mas 'Keynote', id: 409183694
mas 'Numbers', id: 409203825
mas 'Speedtest', id: 1153157709
mas 'Things', id: 904280696
mas 'Tweetbot', id: 1384080005
